import streamlit as st
import pandas as pd


st.header('南宁美食流量数据🍲')
st.markdown('***')



data = {
    '朴大叔拌饭':[200, 150, 180,400, 150, 280,210, 150, 190,200, 150, 180],
    '大叔的虾':[120, 160, 123,500, 180, 380,270, 190, 180,400, 180, 280],
    '喜虾客':[110, 100, 160,300, 170, 280,230, 160, 380,200, 150, 180],
    '成都冒烤鸭':[200, 150, 180,200, 150, 480,260, 250, 160,300, 190, 380],
    '二三麻辣烫':[120, 160, 123,100, 190, 180,250, 140, 300,100, 100, 180]
}
# 月份索引（对应12个月）
month_index = pd.Series(['01月','02月','03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'], name='月份')
flow_df = pd.DataFrame(data, index=month_index)  


# 地图
st.header('📍南宁美食地图')
map_data={
     'latitude':[22.856562,22.835680,22.830934,22.843907,22.789793],
     'longitude':[108.244514,108.244171,108.218079,108.291893,108.312836]
    }
mp_df=pd.DataFrame(map_data)
st.map(mp_df)
st.markdown('***')


# 餐厅评分条形图
pingfen_data = {
    "餐厅名称": ["朴大叔拌饭", "大叔的虾", "喜虾客", "成都冒烤鸭", "二三麻辣烫"],
    "评分": [4, 5, 4.5, 4.5, 4.8]  
}
score_df = pd.DataFrame(pingfen_data).set_index("餐厅名称")  

st.header('⭐ 餐厅评分')
st.bar_chart(
    score_df,
    color="#1f77b4"
)
st.markdown('***')


# 表格数据（显示12个月的流量数据）
st.header('美食流量表格数据🗂')
st.dataframe(flow_df)  
st.markdown('***')


# 折线图（显示12个月的流量数据）
st.header('美食流量折线图📉')
st.line_chart(flow_df)


st.markdown('***')


# 内置面积图（用餐时段高峰期）
peak_data = {
    "时段": ["11.0", "11.5", "12.0", "12.5", "13.0", "13.5", "14.0", "14.5", "15.0", "15.5", "16.0", "16.5", "17.0", "17.5", "18.0", "18.5", "19.0"],
    "朴大叔拌饭": [40, 80, 80, 60, 50, 50, 45, 45, 40, 40, 45, 70, 80, 80, 75, 70, 60],
    "大叔的虾": [40, 95, 85, 70, 65, 60, 55, 50, 45, 40, 40, 50, 60, 75, 85, 80, 70],
    "喜虾客": [40, 85, 70, 55, 50, 45, 40, 80, 35, 35, 40, 65, 85, 80, 75, 70, 65],
    "成都冒烤鸭": [40, 95, 85, 70, 65, 60, 55, 50, 45, 40, 40, 66, 60, 75, 85, 80, 70],
    "二三麻辣烫": [40, 85, 70, 55, 50, 45, 55, 40, 77, 35, 40, 65, 85, 86, 75, 70, 65]

}
peak_df = pd.DataFrame(peak_data).set_index("时段")

# 绘制面积图（基础样式）
st.header('⏱️ 用餐高峰时段')
st.area_chart(
    peak_df,
    color=["#2E86AB", "#A23B72", "#F18F01","#3498DB", "#2ECC71"]  # 对应5家餐厅的颜色
)


st.markdown('***')


